In [1]:
import pandas as pd
score = {'name' : ['A', 'B', 'C', 'D'], 
         'score': [20, 20, 30, 50] , 
         'grade' : ['dd', 'dd', 'ff', 'ee']}

c = pd.DataFrame(data=score)

In [2]:
c

  name  score grade
0    A     20    dd
1    B     20    dd
2    C     30    ff
3    D     50    ee

In [4]:
print(c.index)
print(c.columns)
print(c.values, type(c.values))

RangeIndex(start=0, stop=4, step=1)
Index(['name', 'score', 'grade'], dtype='object')
[['A' 20 'dd']
 ['B' 20 'dd']
 ['C' 30 'ff']
 ['D' 50 'ee']] <class 'numpy.ndarray'>

In [6]:
print(c.shape)
print(c.dtypes)

(4, 3)
name     object
score     int64
grade    object
dtype: object

In [17]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
idx = ['row1', 'row2']
result = pd.DataFrame(data, index=idx)
print(result)
print('\n')

      a   b     c
row1  1   2   NaN
row2  5  10  20.0

In [22]:
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
print(score_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   score    5 non-null      int64
 2   grade    5 non-null      object
 3   subject  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes
None

In [23]:
print(score_df.sample())

   name  score grade subject
2  Alex     80     B  python

In [24]:
print(score_df.sample(2, random_state=10))

    name  score grade subject
2   Alex     80     B  python
3  Jessi     85     B       c

In [25]:
print(score_df.sample(frac=0.5))

    name  score grade subject
2   Alex     80     B  python
3  Jessi     85     B       c

In [26]:
import pandas as pd

score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)

In [28]:
print(score_df)

    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

In [27]:
print(score_df.describe())

            score
count    5.000000
mean    91.400000
std      8.502941
min     80.000000
25%     85.000000
50%     95.000000
75%     97.000000
max    100.000000

In [29]:
print(score_df[['grade', 'subject']].describe())

       grade subject
count      5       5
unique     2       3
top        A  python
freq       3       2

In [30]:
print(score_df.describe(include='all'))

         name       score grade subject
count       5    5.000000     5       5
unique      4         NaN     2       3
top     Jessi         NaN     A  python
freq        2         NaN     3       2
mean      NaN   91.400000   NaN     NaN
std       NaN    8.502941   NaN     NaN
min       NaN   80.000000   NaN     NaN
25%       NaN   85.000000   NaN     NaN
50%       NaN   95.000000   NaN     NaN
75%       NaN   97.000000   NaN     NaN
max       NaN  100.000000   NaN     NaN

In [31]:
score_df['subject'].unique()

array(['python', 'java', 'c'], dtype=object)

In [36]:
score_df['subject'].value_counts(normalize=True)

python    0.4
java      0.4
c         0.2
Name: subject, dtype: float64

In [37]:
d = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
     'score': [100, 95, 80, 85, 97],
     'grade': ['A', 'A', 'B', 'B', 'A'],
     'subject':['python', 'java', 'python', 'c', 'java']}

c = ['name', 'score', 'grade', 'subject', 'etc']
df = pd.DataFrame(data=d, columns=c)
print('Sample Data')
print(df)

Sample Data
    name  score grade subject  etc
0  Jessi    100     A  python  NaN
1   Emma     95     A    java  NaN
2   Alex     80     B  python  NaN
3  Jessi     85     B       c  NaN
4    Tom     97     A    java  NaN

In [38]:
df['name']

0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [39]:
df.name

0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [40]:
type(df.name)

pandas.core.series.Series

In [41]:
df[['name', 'subject', 'grade']]

    name subject grade
0  Jessi  python     A
1   Emma    java     A
2   Alex  python     B
3  Jessi       c     B
4    Tom    java     A

In [42]:
df['etc'] = 0
df

    name  score grade subject  etc
0  Jessi    100     A  python    0
1   Emma     95     A    java    0
2   Alex     80     B  python    0
3  Jessi     85     B       c    0
4    Tom     97     A    java    0

In [43]:
df.loc[1]

name       Emma
score        95
grade         A
subject    java
etc           0
Name: 1, dtype: object

In [44]:
df.loc[[0,2,4]]

    name  score grade subject  etc
0  Jessi    100     A  python    0
2   Alex     80     B  python    0
4    Tom     97     A    java    0

In [45]:
df.loc[0] = ['Jessi', 'java', 70, 'C', 1]
print(df)

    name score grade subject  etc
0  Jessi  java    70       C    1
1   Emma    95     A    java    0
2   Alex    80     B  python    0
3  Jessi    85     B       c    0
4    Tom    97     A    java    0

In [46]:
row_idx = [1,2,4]
col_idx = ['name', 'subject', 'grade']
df.loc[row_idx, col_idx]

   name subject grade
1  Emma    java     A
2  Alex  python     B
4   Tom    java     A

In [49]:
df.at[1, 'name']

'Emma'